micropython/micropython/ports/stm32/stm32_it.c
    print_reg("R0    ", regs->r0);
    print_reg("R1    ", regs->r1);
    print_reg("R2    ", regs->r2);
    print_reg("R3    ", regs->r3);
    print_reg("R12   ", regs->r12);
    print_reg("SP    ", (uint32_t)regs);
    print_reg("LR    ", regs->lr);
    print_reg("PC    ", regs->pc);
    print_reg("XPSR  ", regs->xpsr);

    #if __CORTEX_M >= 3
    uint32_t cfsr = SCB->CFSR;

    print_reg("HFSR  ", SCB->HFSR);
    print_reg("CFSR  ", cfsr);
    if (cfsr & 0x80) {
        print_reg("MMFAR ", SCB->MMFAR);
    }
    if (cfsr & 0x8000) {
        print_reg("BFAR  ", SCB->BFAR);
    }
    #endif

    if ((void *)&_ram_start <= (void *)regs && (void *)regs < (void *)&_ram_end) {
        mp_hal_stdout_tx_str("Stack:\r\n");
        uint32_t *stack_top = &_estack;
        if ((void *)regs < (void *)&_sstack) {
            // stack not in static stack area so limit the amount we print
            stack_top = (uint32_t *)regs + 32;
        }
        for (uint32_t *sp = (uint32_t *)regs; sp < stack_top; ++sp) {
            print_hex_hex("  ", (uint32_t)sp, *sp);
        }
    }

    /* Go to infinite loop when Hard Fault exception occurs */
    while (1) {
        MICROPY_BOARD_FATAL_ERROR("HardFault");
    }
}

// Naked functions have no compiler generated gunk, so are the best thing to
// use for asm functions.
__attribute__((naked))
void HardFault_Handler(void) {

    // From the ARMv7M Architecture Reference Manual, section B.1.5.6
    // on entry to the Exception, the LR register contains, amongst other
    // things, the value of CONTROL.SPSEL. This can be found in bit 3.
    //
    // If CONTROL.SPSEL is 0, then the exception was stacked up using the
    // main stack pointer (aka MSP). If CONTROL.SPSEL is 1, then the exception
    // was stacked up using the process stack pointer (aka PSP).

    #if __CORTEX_M == 0
    __asm volatile (
        " mov r0, lr    \n"
        " lsr r0, r0, #3 \n"    // Shift Bit 3 into carry to see which stack pointer we should use.
        " mrs r0, msp   \n"     // Make R0 point to main stack pointer
        " bcc .use_msp  \n"     // Keep MSP in R0 if SPSEL (carry) is 0
        " mrs r0, psp   \n"     // Make R0 point to process stack pointer
        " .use_msp:     \n"
        " b HardFault_C_Handler \n" // Off to C land
        );
    #else
    __asm volatile (
        " tst lr, #4    \n"     // Test Bit 3 to see which stack pointer we should use.
        " ite eq        \n"     // Tell the assembler that the nest 2 instructions are if-then-else
        " mrseq r0, msp \n"     // Make R0 point to main stack pointer
        " mrsne r0, psp \n"     // Make R0 point to process stack pointer
        " b HardFault_C_Handler \n" // Off to C land
        );
    #endif
}

/**
  * @brief   This function handles NMI exception.
  * @param  None
  * @retval None
  */
void NMI_Handler(void) {
}

/**
  * @brief  This function handles Memory Manage exception.
  * @param  None
  * @retval None
  */
void MemManage_Handler(void) {
    /* Go to infinite loop when Memory Manage exception occurs */
    while (1) {
        MICROPY_BOARD_FATAL_ERROR("MemManage");
    }
}

/**
  * @brief  This function handles Bus Fault exception.
  * @param  None
  * @retval None
  */
void BusFault_Handler(void) {
    /* Go to infinite loop when Bus Fault exception occurs */
    while (1) {
        MICROPY_BOARD_FATAL_ERROR("BusFault");
    }
}

/**
  * @brief  This function handles Usage Fault exception.
  * @param  None
  * @retval None
  */
void UsageFault_Handler(void) {
    /* Go to infinite loop when Usage Fault exception occurs */
    while (1) {
        MICROPY_BOARD_FATAL_ERROR("UsageFault");
    }
}

/**
  * @brief  This function handles SVCall exception.
  * @param  None
  * @retval None
  */
void SVC_Handler(void) {
}

/**
  * @brief  This function handles Debug Monitor exception.
  * @param  None
  * @retval None
  */
void DebugMon_Handler(void) {
}

/******************************************************************************/
/*                 STM32F4xx Peripherals Interrupt Handlers                   */
/*  Add here the Interrupt Handler for the used peripheral(s) (PPP), for the  */
/*  available peripheral interrupt handler's name please refer to the startup */
/*  file (startup_stm32f4xx.s).                                               */
/******************************************************************************/

#if MICROPY_HW_STM_USB_STACK || MICROPY_HW_TINYUSB_STACK

#if defined(STM32G0)

#if MICROPY_HW_USB_FS
void USB_UCPD1_2_IRQHandler(void) {
    #if MICROPY_HW_TINYUSB_STACK
    tud_int_handler(0);
    #else
    HAL_PCD_IRQHandler(&pcd_fs_handle);
    #endif
}
#endif

#elif defined(STM32H5)

#if MICROPY_HW_USB_FS
void USB_DRD_FS_IRQHandler(void) {
    #if MICROPY_HW_TINYUSB_STACK
    tud_int_handler(0);
    #else
    HAL_PCD_IRQHandler(&pcd_fs_handle);
    #endif
}
#endif

#elif defined(STM32L0) || defined(STM32L432xx) || defined(STM32L452xx)

#if MICROPY_HW_USB_FS
void USB_IRQHandler(void) {
    #if MICROPY_HW_TINYUSB_STACK
    tud_int_handler(0);
    #else
    HAL_PCD_IRQHandler(&pcd_fs_handle);
    #endif
}
#endif

#elif defined(STM32G4) || defined(STM32L1) || defined(STM32WB)

#if MICROPY_HW_USB_FS
void USB_LP_IRQHandler(void) {
    #if MICROPY_HW_TINYUSB_STACK
    tud_int_handler(0);
    #else
    HAL_PCD_IRQHandler(&pcd_fs_handle);
    #endif
}
#endif

#else

/**
  * @brief  This function handles USB-On-The-Go FS global interrupt request.
  * @param  None
  * @retval None
  */
#if MICROPY_HW_USB_FS
void OTG_FS_IRQHandler(void) {
    IRQ_ENTER(OTG_FS_IRQn);
    #if MICROPY_HW_TINYUSB_STACK
    tud_int_handler(0);
    #else
    HAL_PCD_IRQHandler(&pcd_fs_handle);
    #endif
    IRQ_EXIT(OTG_FS_IRQn);
}
#endif
#if MICROPY_HW_USB_HS
#if defined(STM32N6)
void USB1_OTG_HS_IRQHandler(void) {
    IRQ_ENTER(USB1_OTG_HS_IRQn);
    #if MICROPY_HW_TINYUSB_STACK
    tud_int_handler(0);
    #else
    HAL_PCD_IRQHandler(&pcd_hs_handle);
    #endif
    IRQ_EXIT(USB1_OTG_HS_IRQn);
}
#else
void OTG_HS_IRQHandler(void) {
    IRQ_ENTER(OTG_HS_IRQn);
    #if MICROPY_HW_TINYUSB_STACK
    tud_int_handler(1); // OTG_HS is always RHPORT1 on F4/F7/H7 (not N6, which uses USB1_OTG_HS_IRQHandler)
    #else
    HAL_PCD_IRQHandler(&pcd_hs_handle);
    #endif
    IRQ_EXIT(OTG_HS_IRQn);
}
#endif
#endif

#if (MICROPY_HW_USB_FS || MICROPY_HW_USB_HS) && !defined(STM32N6)
/**
  * @brief  This function handles USB OTG Common FS/HS Wakeup functions.
  * @param  *pcd_handle for FS or HS
  * @retval None
  */
static void OTG_CMD_WKUP_Handler(PCD_HandleTypeDef *pcd_handle) {

    if (pcd_handle->Init.low_power_enable) {
        /* Reset SLEEPDEEP bit of Cortex System Control Register */
        SCB->SCR &= (uint32_t) ~((uint32_t)(SCB_SCR_SLEEPDEEP_Msk | SCB_SCR_SLEEPONEXIT_Msk));

        /* Configures system clock after wake-up from STOP: enable HSE/HSI, PLL and select
        PLL as system clock source (HSE/HSI and PLL are disabled in STOP mode) */

        __HAL_RCC_HSE_CONFIG(MICROPY_HW_RCC_HSE_STATE);
        #if MICROPY_HW_CLK_USE_HSI
        __HAL_RCC_HSI_ENABLE();
        #endif

        /* Wait till HSE/HSI is ready */
        while (__HAL_RCC_GET_FLAG(MICROPY_HW_RCC_FLAG_HSxRDY) == RESET) {
        }

        /* Enable the main PLL. */
        __HAL_RCC_PLL_ENABLE();

