micropython/micropython/ports/stm32/stm32_it.c
        #if defined(STM32U5)
        /* Wait till PLL is ready */
        while (__HAL_RCC_GET_FLAG(RCC_FLAG_PLL1RDY) == RESET) {
        }

        /* Select PLL as SYSCLK */
        MODIFY_REG(RCC->CFGR1, RCC_CFGR1_SW, RCC_SYSCLKSOURCE_PLLCLK);
        #else
        /* Wait till PLL is ready */
        while (__HAL_RCC_GET_FLAG(RCC_FLAG_PLLRDY) == RESET) {
        }

        /* Select PLL as SYSCLK */
        MODIFY_REG(RCC->CFGR, RCC_CFGR_SW, RCC_SYSCLKSOURCE_PLLCLK);
        #endif

        #if defined(STM32H7)
        while (__HAL_RCC_GET_SYSCLK_SOURCE() != RCC_CFGR_SWS_PLL1) {
        }
        #elif defined(STM32U5)
        while (__HAL_RCC_GET_SYSCLK_SOURCE() != RCC_SYSCLKSOURCE_STATUS_PLLCLK) {
        }
        #else
        while (__HAL_RCC_GET_SYSCLK_SOURCE() != RCC_CFGR_SWS_PLL) {
        }
        #endif

        /* ungate PHY clock */
        __HAL_PCD_UNGATE_PHYCLOCK(pcd_handle);
    }
    #if MICROPY_HW_TINYUSB_STACK
    tud_int_handler(0);
    #endif

}
#endif

#if MICROPY_HW_USB_FS
/**
  * @brief  This function handles USB OTG FS Wakeup IRQ Handler.
  * @param  None
  * @retval None
  */
void OTG_FS_WKUP_IRQHandler(void) {
    IRQ_ENTER(OTG_FS_WKUP_IRQn);

    OTG_CMD_WKUP_Handler(&pcd_fs_handle);

    #if defined(STM32L4)
    EXTI->PR1 = USB_OTG_FS_WAKEUP_EXTI_LINE;
    #elif !defined(STM32H5) && !defined(STM32H7) && !defined(STM32U5)
    /* Clear EXTI pending Bit*/
    __HAL_USB_FS_EXTI_CLEAR_FLAG();
    #endif

    IRQ_EXIT(OTG_FS_WKUP_IRQn);
}
#endif

#if MICROPY_HW_USB_HS && !defined(STM32N6)
/**
  * @brief  This function handles USB OTG HS Wakeup IRQ Handler.
  * @param  None
  * @retval None
  */
void OTG_HS_WKUP_IRQHandler(void) {
    IRQ_ENTER(OTG_HS_WKUP_IRQn);

    OTG_CMD_WKUP_Handler(&pcd_hs_handle);

    #if !defined(STM32H5) && !defined(STM32H7) && !defined(STM32U5)
    /* Clear EXTI pending Bit*/
    __HAL_USB_HS_EXTI_CLEAR_FLAG();
    #endif

    IRQ_EXIT(OTG_HS_WKUP_IRQn);
}
#endif

#endif // !defined(STM32L0)

#endif // MICROPY_HW_STM_USB_STACK || MICROPY_HW_TINYUSB_STACK

/**
  * @brief  This function handles PPP interrupt request.
  * @param  None
  * @retval None
  */
/*void PPP_IRQHandler(void)
{
}*/

void PVD_IRQHandler(void) {
    IRQ_ENTER(PVD_IRQn);
    Handle_EXTI_Irq(EXTI_PVD_OUTPUT);
    IRQ_EXIT(PVD_IRQn);
}

#if defined(STM32L4) || defined(STM32WB) || defined(STM32WL)
void PVD_PVM_IRQHandler(void) {
    IRQ_ENTER(PVD_PVM_IRQn);
    Handle_EXTI_Irq(EXTI_PVD_OUTPUT);
    IRQ_EXIT(PVD_PVM_IRQn);
}
#endif

void RTC_Alarm_IRQHandler(void) {
    IRQ_ENTER(RTC_Alarm_IRQn);
    Handle_EXTI_Irq(EXTI_RTC_ALARM);
    IRQ_EXIT(RTC_Alarm_IRQn);
}

#if defined(ETH)    // The 407 has ETH, the 405 doesn't
void ETH_WKUP_IRQHandler(void) {
    IRQ_ENTER(ETH_WKUP_IRQn);
    Handle_EXTI_Irq(EXTI_ETH_WAKEUP);
    IRQ_EXIT(ETH_WKUP_IRQn);
}
#endif

#if defined(STM32H5) || defined(STM32N6)
void TAMP_IRQHandler(void) {
    IRQ_ENTER(TAMP_IRQn);
    Handle_EXTI_Irq(EXTI_RTC_TAMP);
    IRQ_EXIT(TAMP_IRQn);
}
#elif defined(STM32L1)
void TAMPER_STAMP_IRQHandler(void) {
    IRQ_ENTER(TAMPER_STAMP_IRQn);
    Handle_EXTI_Irq(EXTI_RTC_TIMESTAMP);
    IRQ_EXIT(TAMPER_STAMP_IRQn);
}
#else
void TAMP_STAMP_IRQHandler(void) {
    IRQ_ENTER(TAMP_STAMP_IRQn);
    Handle_EXTI_Irq(EXTI_RTC_TIMESTAMP);
    IRQ_EXIT(TAMP_STAMP_IRQn);
}
#endif

#if !defined(STM32U5)
#if defined(STM32H5)
void RTC_IRQHandler(void)
#elif defined(STM32N6)
#define RTC_WKUP_IRQn RTC_S_IRQn
void RTC_S_IRQHandler(void)
#else
void RTC_WKUP_IRQHandler(void)
#endif
{
    IRQ_ENTER(RTC_WKUP_IRQn);
    #if defined(STM32G0) || defined(STM32G4) || defined(STM32WL)
    RTC->MISR &= ~RTC_MISR_WUTMF; // clear wakeup interrupt flag
    #elif defined(STM32H5) || defined(STM32N6)
    LL_RTC_ClearFlag_WUT(RTC);
    #elif defined(STM32H7A3xx) || defined(STM32H7A3xxQ) || defined(STM32H7B3xx) || defined(STM32H7B3xxQ)
    RTC->SR &= ~RTC_SR_WUTF; // clear wakeup interrupt flag
    #else
    RTC->ISR &= ~RTC_ISR_WUTF; // clear wakeup interrupt flag
    #endif
    Handle_EXTI_Irq(EXTI_RTC_WAKEUP); // clear EXTI flag and execute optional callback
    IRQ_EXIT(RTC_WKUP_IRQn);
}
#endif

#if defined(STM32N6)
void RTC_IRQHandler(void) {
    RTC_S_IRQHandler();
}
#endif

#if defined(STM32F0) || defined(STM32G0) || defined(STM32L0)

#if defined(STM32G0)
void RTC_TAMP_IRQHandler(void) {
    IRQ_ENTER(RTC_TAMP_IRQn);
    RTC->SCR |= RTC_SCR_CWUTF; // clear wakeup interrupt flag
    Handle_EXTI_Irq(EXTI_RTC_WAKEUP);    // clear EXTI flag and execute optional callback
    Handle_EXTI_Irq(EXTI_RTC_TIMESTAMP); // clear EXTI flag and execute optional callback
    IRQ_EXIT(RTC_TAMP_IRQn);
}
#else
void RTC_IRQHandler(void) {
    IRQ_ENTER(RTC_IRQn);
    if (RTC->ISR & RTC_ISR_WUTF) {
        RTC->ISR &= ~RTC_ISR_WUTF; // clear wakeup interrupt flag
        Handle_EXTI_Irq(EXTI_RTC_WAKEUP); // clear EXTI flag and execute optional callback
    }
    if (RTC->ISR & RTC_ISR_ALRAF) {
        RTC->ISR &= ~RTC_ISR_ALRAF; // clear Alarm A flag
        Handle_EXTI_Irq(EXTI_RTC_ALARM); // clear EXTI flag and execute optional callback
    }
    if (RTC->ISR & RTC_ISR_TSF) {
        RTC->ISR &= ~RTC_ISR_TSF; // clear timestamp flag
        Handle_EXTI_Irq(EXTI_RTC_TIMESTAMP); // clear EXTI flag and execute optional callback
    }
    IRQ_EXIT(RTC_IRQn);
}
#endif

void TIM1_BRK_UP_TRG_COM_IRQHandler(void) {
    IRQ_ENTER(TIM1_BRK_UP_TRG_COM_IRQn);
    timer_irq_handler(1);
    IRQ_EXIT(TIM1_BRK_UP_TRG_COM_IRQn);
}

#endif

#if defined(STM32U5)
extern RTC_HandleTypeDef RTCHandle;
void RTC_IRQHandler(void) {
    IRQ_ENTER(RTC_IRQn);
    if (RTC->SR & RTC_SR_WUTF) {
        RTC->SCR = RTC_SCR_CWUTF; // clear wakeup interrupt flag
        Handle_EXTI_Irq(EXTI_RTC_WAKEUP); // clear EXTI flag and execute optional callback
    }
    if (RTC->SR & RTC_SR_ALRAF) {
        RTC->SCR &= ~RTC_SCR_CALRAF; // clear Alarm A flag
        Handle_EXTI_Irq(EXTI_RTC_ALARM); // clear EXTI flag and execute optional callback
    }
    if (RTC->SR & RTC_SR_TSF) {
        RTC->SR &= ~RTC_SR_TSF; // clear timestamp flag
        Handle_EXTI_Irq(EXTI_RTC_TIMESTAMP); // clear EXTI flag and execute optional callback
    }
    IRQ_EXIT(RTC_IRQn);
}
#endif

void TIM1_BRK_TIM9_IRQHandler(void) {
    IRQ_ENTER(TIM1_BRK_TIM9_IRQn);
    timer_irq_handler(9);
    IRQ_EXIT(TIM1_BRK_TIM9_IRQn);
}

