micropython/micropython/ports/stm32/stm32_it.c
#if defined(STM32G4) || defined(STM32L4)
void TIM1_BRK_TIM15_IRQHandler(void) {
    IRQ_ENTER(TIM1_BRK_TIM15_IRQn);
    timer_irq_handler(15);
    IRQ_EXIT(TIM1_BRK_TIM15_IRQn);
}
#endif

void TIM1_UP_TIM10_IRQHandler(void) {
    IRQ_ENTER(TIM1_UP_TIM10_IRQn);
    timer_irq_handler(1);
    timer_irq_handler(10);
    IRQ_EXIT(TIM1_UP_TIM10_IRQn);
}

#if defined(STM32G4) || defined(STM32L4) || defined(STM32WB)
void TIM1_UP_TIM16_IRQHandler(void) {
    IRQ_ENTER(TIM1_UP_TIM16_IRQn);
    timer_irq_handler(1);
    timer_irq_handler(16);
    IRQ_EXIT(TIM1_UP_TIM16_IRQn);
}
#endif

#if defined(STM32H7) || defined(STM32N6)
void TIM1_UP_IRQHandler(void) {
    IRQ_ENTER(TIM1_UP_IRQn);
    timer_irq_handler(1);
    IRQ_EXIT(TIM1_UP_IRQn);
}
#endif

void TIM1_TRG_COM_TIM11_IRQHandler(void) {
    IRQ_ENTER(TIM1_TRG_COM_TIM11_IRQn);
    timer_irq_handler(11);
    IRQ_EXIT(TIM1_TRG_COM_TIM11_IRQn);
}

#if defined(STM32G4) || defined(STM32L4) || defined(STM32WB)
void TIM1_TRG_COM_TIM17_IRQHandler(void) {
    IRQ_ENTER(TIM1_TRG_COM_TIM17_IRQn);
    timer_irq_handler(17);
    IRQ_EXIT(TIM1_TRG_COM_TIM17_IRQn);
}
#endif

void TIM1_CC_IRQHandler(void) {
    IRQ_ENTER(TIM1_CC_IRQn);
    timer_irq_handler(1);
    IRQ_EXIT(TIM1_CC_IRQn);
}

void TIM2_IRQHandler(void) {
    IRQ_ENTER(TIM2_IRQn);
    timer_irq_handler(2);
    IRQ_EXIT(TIM2_IRQn);
}

#if defined(STM32G0)
void TIM3_TIM4_IRQHandler(void) {
    IRQ_ENTER(TIM3_TIM4_IRQn);
    timer_irq_handler(3);
    timer_irq_handler(4);
    IRQ_EXIT(TIM3_TIM4_IRQn);
}

#else
void TIM3_IRQHandler(void) {
    IRQ_ENTER(TIM3_IRQn);
    timer_irq_handler(3);
    IRQ_EXIT(TIM3_IRQn);
}

void TIM4_IRQHandler(void) {
    IRQ_ENTER(TIM4_IRQn);
    timer_irq_handler(4);
    IRQ_EXIT(TIM4_IRQn);
}
#endif

void TIM5_IRQHandler(void) {
    IRQ_ENTER(TIM5_IRQn);
    timer_irq_handler(5);
    HAL_TIM_IRQHandler(&TIM5_Handle);
    IRQ_EXIT(TIM5_IRQn);
}

#if defined(TIM6) // STM32F401 doesn't have TIM6
#if defined(STM32G0)
void TIM6_DAC_LPTIM1_IRQHandler(void) {
    IRQ_ENTER(TIM6_DAC_LPTIM1_IRQn);
    timer_irq_handler(6);
    IRQ_EXIT(TIM6_DAC_LPTIM1_IRQn);
}
#elif defined(STM32L1)
void TIM6_IRQHandler(void) {
    IRQ_ENTER(TIM6_IRQn);
    timer_irq_handler(6);
    IRQ_EXIT(TIM6_IRQn);
}
#else
void TIM6_DAC_IRQHandler(void) {
    IRQ_ENTER(TIM6_DAC_IRQn);
    timer_irq_handler(6);
    IRQ_EXIT(TIM6_DAC_IRQn);
}
#endif
#endif

#if defined(TIM7) // STM32F401 doesn't have TIM7
#if defined(STM32G0)
void TIM7_LPTIM2_IRQHandler(void) {
    IRQ_ENTER(TIM7_LPTIM2_IRQn);
    timer_irq_handler(7);
    IRQ_EXIT(TIM7_LPTIM2_IRQn);
}
#elif defined(STM32G4)
void TIM7_DAC_IRQHandler(void) {
    IRQ_ENTER(TIM7_DAC_IRQn);
    timer_irq_handler(7);
    IRQ_EXIT(TIM7_DAC_IRQn);
}
#else
void TIM7_IRQHandler(void) {
    IRQ_ENTER(TIM7_IRQn);
    timer_irq_handler(7);
    IRQ_EXIT(TIM7_IRQn);
}
#endif
#endif

#if defined(TIM8) // STM32F401 doesn't have TIM8
void TIM8_BRK_TIM12_IRQHandler(void) {
    IRQ_ENTER(TIM8_BRK_TIM12_IRQn);
    timer_irq_handler(12);
    IRQ_EXIT(TIM8_BRK_TIM12_IRQn);
}

void TIM8_UP_TIM13_IRQHandler(void) {
    IRQ_ENTER(TIM8_UP_TIM13_IRQn);
    timer_irq_handler(8);
    timer_irq_handler(13);
    IRQ_EXIT(TIM8_UP_TIM13_IRQn);
}

#if defined(STM32G4) || defined(STM32H5) || defined(STM32L4)
void TIM8_UP_IRQHandler(void) {
    IRQ_ENTER(TIM8_UP_IRQn);
    timer_irq_handler(8);
    IRQ_EXIT(TIM8_UP_IRQn);
}
#endif

void TIM8_CC_IRQHandler(void) {
    IRQ_ENTER(TIM8_CC_IRQn);
    timer_irq_handler(8);
    IRQ_EXIT(TIM8_CC_IRQn);
}

void TIM8_TRG_COM_TIM14_IRQHandler(void) {
    IRQ_ENTER(TIM8_TRG_COM_TIM14_IRQn);
    timer_irq_handler(14);
    IRQ_EXIT(TIM8_TRG_COM_TIM14_IRQn);
}
#endif

#if defined(STM32L1)
void TIM9_IRQHandler(void) {
    IRQ_ENTER(TIM9_IRQn);
    timer_irq_handler(9);
    IRQ_EXIT(TIM9_IRQn);
}

void TIM10_IRQHandler(void) {
    IRQ_ENTER(TIM9_IRQn);
    timer_irq_handler(10);
    IRQ_EXIT(TIM9_IRQn);
}

void TIM11_IRQHandler(void) {
    IRQ_ENTER(TIM9_IRQn);
    timer_irq_handler(11);
    IRQ_EXIT(TIM9_IRQn);
}
#endif

#if defined(STM32G0)
void TIM14_IRQHandler(void) {
    IRQ_ENTER(TIM14_IRQn);
    timer_irq_handler(14);
    IRQ_EXIT(TIM14_IRQn);
}

void TIM15_IRQHandler(void) {
    IRQ_ENTER(TIM15_IRQn);
    timer_irq_handler(15);
    IRQ_EXIT(TIM15_IRQn);
}

void TIM16_FDCAN_IT0_IRQHandler(void) {
    IRQ_ENTER(TIM16_FDCAN_IT0_IRQn);
    timer_irq_handler(16);
    IRQ_EXIT(TIM16_FDCAN_IT0_IRQn);
}

void TIM17_FDCAN_IT1_IRQHandler(void) {
    IRQ_ENTER(TIM17_FDCAN_IT1_IRQn);
    timer_irq_handler(17);
    IRQ_EXIT(TIM17_FDCAN_IT1_IRQn);
}
#endif

#if defined(STM32G4)
void TIM20_UP_IRQHandler(void) {
    IRQ_ENTER(TIM20_UP_IRQn);
    timer_irq_handler(20);
    IRQ_EXIT(TIM20_UP_IRQn);
}
#endif

#if defined(STM32H7)
void TIM15_IRQHandler(void) {
    IRQ_ENTER(TIM15_IRQn);
    timer_irq_handler(15);
    IRQ_EXIT(TIM15_IRQn);
}

void TIM16_IRQHandler(void) {
    IRQ_ENTER(TIM16_IRQn);
    timer_irq_handler(16);
    IRQ_EXIT(TIM16_IRQn);
}

void TIM17_IRQHandler(void) {
    IRQ_ENTER(TIM17_IRQn);
    timer_irq_handler(17);
    IRQ_EXIT(TIM17_IRQn);
}
#endif

// UART/USART IRQ handlers
void USART1_IRQHandler(void) {
    IRQ_ENTER(USART1_IRQn);
    uart_irq_handler(1);
    IRQ_EXIT(USART1_IRQn);
}

#if defined(USART2)
void USART2_IRQHandler(void) {
    IRQ_ENTER(USART2_IRQn);
    uart_irq_handler(2);
    IRQ_EXIT(USART2_IRQn);
}
#endif

#if defined(STM32F0)

void USART3_8_IRQHandler(void) {
    IRQ_ENTER(USART3_8_IRQn);
    uart_irq_handler(3);
    uart_irq_handler(4);
    uart_irq_handler(5);
    uart_irq_handler(6);
    uart_irq_handler(7);
    uart_irq_handler(8);
    IRQ_EXIT(USART3_8_IRQn);
}

#elif defined(STM32G0)

#if defined(STM32G0B1xx) || defined(STM32G0C1xx)
void USART2_LPUART2_IRQHandler(void) {
    IRQ_ENTER(USART2_LPUART2_IRQn);
    uart_irq_handler(2);
    uart_irq_handler(PYB_LPUART_2);
    IRQ_EXIT(USART2_LPUART2_IRQn);
}

void USART3_4_5_6_LPUART1_IRQHandler(void) {
    IRQ_ENTER(USART3_4_5_6_LPUART1_IRQn);
    uart_irq_handler(3);
    uart_irq_handler(4);
    uart_irq_handler(5);
    uart_irq_handler(6);
    uart_irq_handler(PYB_LPUART_1);
    IRQ_EXIT(USART3_4_5_6_LPUART1_IRQn);
}
#else
#error Unsupported processor
#endif

#elif defined(STM32L0)

void USART4_5_IRQHandler(void) {
    IRQ_ENTER(USART4_5_IRQn);
    uart_irq_handler(4);
    uart_irq_handler(5);
    IRQ_EXIT(USART4_5_IRQn);
}

#else

#if defined(USART3)
void USART3_IRQHandler(void) {
    IRQ_ENTER(USART3_IRQn);
    uart_irq_handler(3);
    IRQ_EXIT(USART3_IRQn);
}
#endif

#if defined(USART4)
void USART4_IRQHandler(void) {
    IRQ_ENTER(USART4_IRQn);
    uart_irq_handler(4);
    IRQ_EXIT(USART4_IRQn);
}
#endif

#if defined(UART4)
void UART4_IRQHandler(void) {
    IRQ_ENTER(UART4_IRQn);
    uart_irq_handler(4);
    IRQ_EXIT(UART4_IRQn);
}
#endif

