micropython/micropython/ports/stm32/stm32_it.c
#if defined(USART5)
void USART5_IRQHandler(void) {
    IRQ_ENTER(USART5_IRQn);
    uart_irq_handler(5);
    IRQ_EXIT(USART5_IRQn);
}
#endif

#if defined(UART5)
void UART5_IRQHandler(void) {
    IRQ_ENTER(UART5_IRQn);
    uart_irq_handler(5);
    IRQ_EXIT(UART5_IRQn);
}
#endif

#if defined(USART6)
void USART6_IRQHandler(void) {
    IRQ_ENTER(USART6_IRQn);
    uart_irq_handler(6);
    IRQ_EXIT(USART6_IRQn);
}
#endif

#if defined(UART7)
void UART7_IRQHandler(void) {
    IRQ_ENTER(UART7_IRQn);
    uart_irq_handler(7);
    IRQ_EXIT(UART7_IRQn);
}
#endif

#if defined(UART8)
void UART8_IRQHandler(void) {
    IRQ_ENTER(UART8_IRQn);
    uart_irq_handler(8);
    IRQ_EXIT(UART8_IRQn);
}
#endif

#if defined(UART9)
void UART9_IRQHandler(void) {
    IRQ_ENTER(UART9_IRQn);
    uart_irq_handler(9);
    IRQ_EXIT(UART9_IRQn);
}
#endif

#if defined(UART10)
void UART10_IRQHandler(void) {
    IRQ_ENTER(UART10_IRQn);
    uart_irq_handler(10);
    IRQ_EXIT(UART10_IRQn);
}
#endif

#if defined(USART10)
void USART10_IRQHandler(void) {
    IRQ_ENTER(USART10_IRQn);
    uart_irq_handler(10);
    IRQ_EXIT(USART10_IRQn);
}
#endif

#if defined(USART11)
void USART11_IRQHandler(void) {
    IRQ_ENTER(USART11_IRQn);
    uart_irq_handler(11);
    IRQ_EXIT(USART11_IRQn);
}
#endif

#if defined(UART12)
void UART12_IRQHandler(void) {
    IRQ_ENTER(UART12_IRQn);
    uart_irq_handler(12);
    IRQ_EXIT(UART12_IRQn);
}
#endif

#endif

#if defined(LPUART1)
void LPUART1_IRQHandler(void) {
    IRQ_ENTER(LPUART1_IRQn);
    uart_irq_handler(PYB_LPUART_1);
    IRQ_EXIT(LPUART1_IRQn);
}
#endif

#if defined(LPUART2)
void LPUART2_IRQHandler(void) {
    IRQ_ENTER(LPUART2_IRQn);
    uart_irq_handler(PYB_LPUART_2);
    IRQ_EXIT(LPUART2_IRQn);
}
#endif
